Autodesk.Navisworks.Api.Plugins.CustomPlugin
A custom plugin is the most basic plugin that can be defined.
It can be used when none of the specialized behaviour of other plugin tyes is required.

Autodesk.Navisworks.Api.Plugins.CustomPlugin.#ctor
Default constructor for a CustomPlugin